---
kind: property
id: P:Autodesk.Revit.DB.Line.Origin
zh: 原点
source: html/9cd4a24f-166c-8772-8834-2171020b96d3.htm
---
# Autodesk.Revit.DB.Line.Origin Property

**中文**: 原点

Returns the origin of the line.

## Syntax (C#)
```csharp
public XYZ Origin { get; }
```